  ---
  Slave节点REST API说明
  ---
  ---
  ${maven.build.timestamp}

Slave节点REST API说明

%{toc|section=1|fromDepth=0}  

* 创建任务接口

** URL

------
  http://192.168.3.23:8989/slave/jobs
------

** 返回格式

------
  json
------

** HTTP请求方式

------
  PUT
------

** 请求参数

	* 创建网络巡检任务

*---------------+-------+-------+--------------------------------+
|| 参数			|| 必选	|| 类型	|| 说明							 |
*---------------+-------+-------+--------------------------------+
| jobType 		| true 	| string| 任务类型, 值是NETWORK_INSPECT	 |
*---------------+-------+-------+--------------------------------+
|	url			| true 	|string | 版块地址，必须是数据库中已存在 |
*---------------+-------+-------+--------------------------------+
|prevFetchTime 	| false	| long 	|上次抓取时间					 |
*---------------+-------+-------+--------------------------------+
|comment	 	| false | string| 版块名称，用于任务抓取日志记录 |
*---------------+-------+-------+--------------------------------+

	* 创建全网搜索任务

*---------------+-------+-------+--------------------------------+
||	参数		||必选	|| 类型	||说明							 |
*---------------+-------+-------+--------------------------------+
|jobType 		| true 	| string| 任务类型, 值是NETWORK_SEARCH	 |
*---------------+-------+-------+--------------------------------+
|keyword 		| true 	|string | 版块地址，必须是数据库中已存在 |
*---------------+-------+-------+--------------------------------+
|engineUrl		| true	| string|搜索引擎地址模板				 |
*---------------+-------+-------+--------------------------------+

** 请求JSON示例

	* 创建网络巡检

+---+
{
	"jobType":"NETWORK_INSPECT",
	"args":{
		"prevFetchTime":1417830912810,
		"comment":"新浪新闻滚动",
		"url":"http://roll.news.sina.com.cn/s/channel.php"
	}
}
+---+

	* 创建全网搜索

+---+
{
	"jobType":"NETWORK_SEARCH",
	"args": {
		"keyword":"我要爆料 ",
		"engineUrl":"http://www.baidu.com/s?wd=%s&ie=utf-8"
	}
}
+---+

** 返回结果JSON示例

+---+
{
	"code":"22",
	"msg":"create job success."
}
+---+

** 返回字段说明

*------------+----------+-----------+
||返回值字段 ||字段类型	|| 字段说明	|
*------------+----------+-----------+
|code		 | int 		| 代码		|
*------------+----------+-----------+
|	msg		 | string	| 返回消息	|
*------------+----------+-----------+
